const transport = [
  {
    id: "0",
    name: "Междугородний транспорт",
    variants: [
      {
        id: "0",
        name: "Калуга-Товарково",
        routes: [
          {
            id: 0,
            name: "5:17",
            halt: [
              {
                id: "0",
                name: "Калуга,автовокзал",
                time: "5-17",
              },
              {
                id: "1",
                name: "Калуга, 6 школа",
                time: "5-28",
              },
              {
                id: "2",
                name: '"Калуга-Бор", санаторий',
                time: "5-30",
              },
            ],
          },
        ],
      },
    ],
  },
];
