export const countryTransport = [
  {
    id: "0",
    name: "29",

    stopsAb:
      "Калуга 1 - ул. Ленина - ул. Кирова - пл. Мира - ул. Гагарина - Калуга - Правобережный пр-д - ул. Генерала Попова - ул. Фомушина - ул. 65 лет Победы - ул. Георгия Амелина - ул. Братьев Луканиных - Конечная Кошелев-Проект",
    stopsbA:
      "Кошелев-проект - ул. Братьев Луканиных - ул. Георгия Амелина - ул. 65 лет Победы - Калуга - ул. Генерала Попова - Правобережный пр-д - Калуга - ул. Гагарина - ул. Кирова - ул. Ленина - 3 - Конечная Калуга-1",
    routesTO: [
      {
        id: 0,
        name: "06:35",
        halt: [],
      },
      {
        id: 0,
        name: "07:20",
        halt: [],
      },
      {
        id: 0,
        name: "08:10",
        halt: [],
      },
      {
        id: 0,
        name: "09:10",
        halt: [],
      },
      {
        id: 0,
        name: "10:10",
        halt: [],
      },
      {
        id: 0,
        name: "11:10",
        halt: [],
      },
      {
        id: 0,
        name: "12:10",
        halt: [],
      },
      {
        id: 0,
        name: "14:10",
        halt: [],
      },
      {
        id: 0,
        name: "15:10",
        halt: [],
      },
      {
        id: 0,
        name: "16:10",
        halt: [],
      },
      {
        id: 0,
        name: "17:10",
        halt: [],
      },
      {
        id: 0,
        name: "18:10",
        halt: [],
      },
      {
        id: 0,
        name: "19:10",
        halt: [],
      },
      {
        id: 0,
        name: "20:10",
        halt: [],
      },
      {
        id: 0,
        name: "21:20",
        halt: [],
      },
      {
        id: 0,
        name: "22:00",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:10 (по будням)",
        halt: [],
      },
      {
        id: 0,
        name: "06:35",
        halt: [],
      },
      {
        id: 0,
        name: "07:30",
        halt: [],
      },
      {
        id: 0,
        name: "08:10",
        halt: [],
      },
      {
        id: 0,
        name: "09:10",
        halt: [],
      },
      {
        id: 0,
        name: "10:10",
        halt: [],
      },
      {
        id: 0,
        name: "11:10",
        halt: [],
      },
      {
        id: 0,
        name: "12:10",
        halt: [],
      },
      {
        id: 0,
        name: "14:10",
        halt: [],
      },
      {
        id: 0,
        name: "15:10",
        halt: [],
      },
      {
        id: 0,
        name: "16:10",
        halt: [],
      },
      {
        id: 0,
        name: "17:10",
        halt: [],
      },
      {
        id: 0,
        name: "18:10",
        halt: [],
      },
      {
        id: 0,
        name: "19:10",
        halt: [],
      },
      {
        id: 0,
        name: "20:10",
        halt: [],
      },
      {
        id: 0,
        name: "21:20",
        halt: [],
      },
      {
        id: 0,
        name: "22:00",
        halt: [],
      },
    ],
  },
];

export const transport = [
  {
    id: "0",
    name: "Пригородный транспорт",
    enName: "BetweenCountry",
    variants: [
      {
        id: "0",
        name: "Калуга-Товарково",
        routes: [
          {
            id: 0,
            name: "5:17",
            halt: [
              {
                id: "0",
                name: "Калуга,автовокзал",
                time: "5-17",
              },
              {
                id: "1",
                name: "Калуга, 6 школа",
                time: "5-28",
              },
              {
                id: "2",
                name: '"Калуга-Бор", санаторий',
                time: "5-30",
              },
            ],
          },
          {
            id: 1,
            name: "5:20",
            halt: [
              {
                id: "0",
                name: "Калуга,автовокзал",
                time: "5-30",
              },
              {
                id: "1",
                name: "Калуга, 6 школа",
                time: "5-33",
              },
              {
                id: "2",
                name: '"Лесная Сказка", санаторий',
                time: "5-35",
              },
              {
                id: "2",
                name: '"Сокол", санаторий',
                time: "5-36",
              },
            ],
          },
        ],
      },
    ],
  },
];
