export const countryTransport = [
  {
    id: "0",
    name: "29",
    stopsAb:
      "Калуга 1 - ул. Ленина - ул. Кирова - пл. Мира - ул. Гагарина - Калуга - Правобережный пр-д - ул. Генерала Попова - ул. Фомушина - ул. 65 лет Победы - ул. Георгия Амелина - ул. Братьев Луканиных - Конечная Кошелев-Проект",
    stopsbA:
      "Кошелев-проект - ул. Братьев Луканиных - ул. Георгия Амелина - ул. 65 лет Победы - Калуга - ул. Генерала Попова - Правобережный пр-д - Калуга - ул. Гагарина - ул. Кирова - ул. Ленина - 3 - Конечная Калуга-1",
    routesTO: [
      {
        id: 0,
        name: "06:35",
        halt: [],
      },
      {
        id: 1,
        name: "07:20",
        halt: [],
      },
      {
        id: 2,
        name: "08:10",
        halt: [],
      },
      {
        id: 3,
        name: "09:10",
        halt: [],
      },
      {
        id: 4,
        name: "10:10",
        halt: [],
      },
      {
        id: 5,
        name: "11:10",
        halt: [],
      },
      {
        id: 6,
        name: "12:10",
        halt: [],
      },
      {
        id: 7,
        name: "14:10",
        halt: [],
      },
      {
        id: 8,
        name: "15:10",
        halt: [],
      },
      {
        id: 9,
        name: "16:10",
        halt: [],
      },
      {
        id: 10,
        name: "17:10",
        halt: [],
      },
      {
        id: 11,
        name: "18:10",
        halt: [],
      },
      {
        id: 12,
        name: "19:10",
        halt: [],
      },
      {
        id: 13,
        name: "20:10",
        halt: [],
      },
      {
        id: 14,
        name: "21:20",
        halt: [],
      },
      {
        id: 15,
        name: "22:00",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:10 (по будням)",
        halt: [],
      },
      {
        id: 1,
        name: "06:35",
        halt: [],
      },
      {
        id: 2,
        name: "07:30",
        halt: [],
      },
      {
        id: 3,
        name: "08:10",
        halt: [],
      },
      {
        id: 4,
        name: "09:10",
        halt: [],
      },
      {
        id: 5,
        name: "10:10",
        halt: [],
      },
      {
        id: 6,
        name: "11:10",
        halt: [],
      },
      {
        id: 7,
        name: "12:10",
        halt: [],
      },
      {
        id: 8,
        name: "14:10",
        halt: [],
      },
      {
        id: 9,
        name: "15:10",
        halt: [],
      },
      {
        id: 10,
        name: "16:10",
        halt: [],
      },
      {
        id: 11,
        name: "17:10",
        halt: [],
      },
      {
        id: 12,
        name: "18:10",
        halt: [],
      },
      {
        id: 13,
        name: "19:10",
        halt: [],
      },
      {
        id: 14,
        name: "20:10",
        halt: [],
      },
      {
        id: 15,
        name: "21:20",
        halt: [],
      },
      {
        id: 16,
        name: "22:00",
        halt: [],
      },
    ],
  },
  {
    id: "1",
    name: "33",
    stopsAb:
      "Рынок (ул. Герцена) - Калуга - ул. Кирова - пл. Мира - ул. Гагарина - Калуга - ул. Лесная - Лесная",
    stopsbA:
      "Лесная - ул. Лесная - Калуга - ул. Гагарина - ул. Плеханова - Калуга - Рынок (ул. Герцена)",
    routesTO: [
      {
        id: 0,
        name: "06:00",
        halt: [],
      },
      {
        id: 1,
        name: "07:00",
        halt: [],
      },
      {
        id: 2,
        name: "08:00",
        halt: [],
      },
      {
        id: 3,
        name: "09:00",
        halt: [],
      },
      {
        id: 4,
        name: "11:00",
        halt: [],
      },
      {
        id: 5,
        name: "12:00",
        halt: [],
      },
      {
        id: 6,
        name: "13:00",
        halt: [],
      },
      {
        id: 7,
        name: "15:30",
        halt: [],
      },
      {
        id: 8,
        name: "16:30",
        halt: [],
      },
      {
        id: 9,
        name: "17:30",
        halt: [],
      },
      {
        id: 10,
        name: "18:30",
        halt: [],
      },
      {
        id: 11,
        name: "20:30",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:30",
        halt: [],
      },
      {
        id: 1,
        name: "07:30",
        halt: [],
      },
      {
        id: 2,
        name: "08:30",
        halt: [],
      },
      {
        id: 3,
        name: "09:30",
        halt: [],
      },
      {
        id: 4,
        name: "11:30",
        halt: [],
      },
      {
        id: 5,
        name: "12:30",
        halt: [],
      },
      {
        id: 6,
        name: "13:30",
        halt: [],
      },
      {
        id: 7,
        name: "16:00",
        halt: [],
      },
      {
        id: 8,
        name: "17:00",
        halt: [],
      },
      {
        id: 9,
        name: "18:00",
        halt: [],
      },
      {
        id: 10,
        name: "19:00",
        halt: [],
      },
      {
        id: 11,
        name: "21:00",
        halt: [],
      },
    ],
  },
  {
    id: "2",
    name: "41",
    stopsAb:
      "Рынок (ул. Кирова) - ул. Кирова - ул. Степана Разина - ул. Тульская - ул. Киевка - ул. 40 лет Октября - ул. Советская ( Турынино ) - Ждамировская ул. - Калуга - Ждамирово-2",
    stopsbA:
      "Ждамирово-2 - Калуга - Ждамировская ул. - ул. Советская ( Турынино ) - ул. 40 лет Октября - ул. Киевка - ул. Тульская - пер. Фридриха Энгельса - ул. Степана Разина - пл. Победы - ул. Кирова - пл. Мира - Рынок (ул. Кирова)",
    routesTO: [
      {
        id: 0,
        name: "05:50",
        halt: [],
      },
      {
        id: 1,
        name: "06:50",
        halt: [],
      },
      {
        id: 2,
        name: "08:00",
        halt: [],
      },
      {
        id: 3,
        name: "09:20",
        halt: [],
      },
      {
        id: 4,
        name: "12:00",
        halt: [],
      },
      {
        id: 5,
        name: "13:20",
        halt: [],
      },
      {
        id: 6,
        name: "15:40",
        halt: [],
      },
      {
        id: 7,
        name: "17:05 (ч/з Кр.Городок)",
        halt: [],
      },
      {
        id: 8,
        name: "18:35 (ч/з Кр.Городок)",
        halt: [],
      },
      {
        id: 9,
        name: "21:00",
        halt: [],
      },
      {
        id: 10,
        name: "22:10",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:20",
        halt: [],
      },
      {
        id: 1,
        name: "07:25",
        halt: [],
      },
      {
        id: 2,
        name: "08:40",
        halt: [],
      },
      {
        id: 3,
        name: "10:00",
        halt: [],
      },
      {
        id: 4,
        name: "12:40",
        halt: [],
      },
      {
        id: 5,
        name: "14:00",
        halt: [],
      },
      {
        id: 6,
        name: "16:20",
        halt: [],
      },
      {
        id: 7,
        name: "17:50",
        halt: [],
      },
      {
        id: 8,
        name: "19:20",
        halt: [],
      },
      {
        id: 9,
        name: "21:40",
        halt: [],
      },
      {
        id: 10,
        name: "22:40",
        halt: [],
      },
      {
        id: 11,
        name: "",
        halt: [],
      },
      {
        id: 11,
        name: "",
        halt: [],
      },
    ],
  },
  {
    id: "3",
    name: "42",
    stopsAb:
      "Рынок (ул. Кирова) - ул. Кирова - ул. Степана Разина - ул. Тульская - ул. Киевка - ул. 40 лет Октября - ул. Советская ( Турынино ) - Ждамировская ул. - Городенская ул. - Красный Городок - Красный городок",
    stopsbA:
      "Красный городок - Красный Городок - Городенская ул. - Ждамировская ул. - ул. Советская ( Турынино ) - ул. 40 лет Октября - ул. Киевка - ул. Тульская - пер. Фридриха Энгельса - ул. Степана Разина - пл. Победы - ул. Кирова - Рынок (ул. Кирова)",
    routesTO: [
      {
        id: 0,
        name: "06:10",
        halt: [],
      },
      {
        id: 1,
        name: "07:30",
        halt: [],
      },
      {
        id: 2,
        name: "08:50",
        halt: [],
      },
      {
        id: 3,
        name: "11:15",
        halt: [],
      },
      {
        id: 4,
        name: "12:40",
        halt: [],
      },
      {
        id: 5,
        name: "15:10",
        halt: [],
      },
      {
        id: 6,
        name: "16:40",
        halt: [],
      },
      {
        id: 7,
        name: "19:10",
        halt: [],
      },
      {
        id: 8,
        name: "20:30",
        halt: [],
      },
      {
        id: 9,
        name: "21:40",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:50",
        halt: [],
      },
      {
        id: 1,
        name: "08:10",
        halt: [],
      },
      {
        id: 2,
        name: "09:25",
        halt: [],
      },
      {
        id: 3,
        name: "12:00",
        halt: [],
      },
      {
        id: 4,
        name: "13:20",
        halt: [],
      },
      {
        id: 5,
        name: "15:50",
        halt: [],
      },
      {
        id: 6,
        name: "17:20",
        halt: [],
      },
      {
        id: 7,
        name: "19:50",
        halt: [],
      },
      {
        id: 8,
        name: "21:10",
        halt: [],
      },
      {
        id: 9,
        name: "22:15",
        halt: [],
      },
    ],
  },
];

export const transport = [
  {
    id: "0",
    nameA: "Калуга",
    nameB: "Товарково",
    stopsAb:
      'Калуга, автовокзал - Калуга, Школа №6 - "Калуга-Бор", санаторий - "Лесная Сказка" - "Сокол" - Анненки / Областная больница, поворот - Анненки, Пост ДПС - "Орленок", лагерь отдыха - Калуга-2, поворот - Мстихино - Мстихинский карьер - "Спутник", детский оздоровительный лагерь - Село имени Льва Толстого - Комплекс МТФ - Каравай - Дачи Товарковские - Акатово - ЛТП - Улица Дзержинского - Шаня, поворот - Шаня - Товарково',
    stopsbA:
      'Товарково - Шаня - Шаня, поворот - Улица Дзержинского  - ЛТП  - Акатово  - Дачи Товарковские  - Каравай  - Комплекс МТФ  - Село имени Льва Толстого  - "Спутник", детский оздоровительный лагерь  - Мстихинский карьер  - Мстихино\n  Калуга-2, поворот  - "Орленок", лагерь отдыха  - Анненки, Пост ДПС  - Анненки / Областная больница, поворот  - "Сокол",  - "Лесная Сказка"  - "Калуга-Бор", санаторий - Калуга, Школа №6 - Калуга, автовокзал',
    routesTo: [
      {
        id: 0,
        name: "05:17",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 1,
        name: "05:20",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 2,
        name: "05:52",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 3,
        name: "06:00",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 4,
        name: "06:15",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 5,
        name: "06:37",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 6,
        name: "07:05",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 7,
        name: "07:25",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 8,
        name: "07:42",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 9,
        name: "08:15",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 10,
        name: "08:25",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 11,
        name: "08:45",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 12,
        name: "09:10",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 13,
        name: "09:30",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 14,
        name: "09:50",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 15,
        name: "10:15",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 16,
        name: "10:37",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 17,
        name: "11:05",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 18,
        name: "11:35",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 19,
        name: "12:10",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 20,
        name: "12:25",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 21,
        name: "12:50",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 22,
        name: "13:20",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 23,
        name: "13:40",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 24,
        name: "14:10",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 25,
        name: "14:40",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 26,
        name: "15:00",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 27,
        name: "15:25",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 28,
        name: "15:45",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 29,
        name: "16:05",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
      {
        id: 30,
        name: "16:32",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 31,
        name: "17:02",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 32,
        name: "17:35",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 33,
        name: "18:05",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 34,
        name: "18:25",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 35,
        name: "18:50",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 36,
        name: "19:45",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 37,
        name: "20:20",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 38,
        name: "21:10",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
      {
        id: 39,
        name: "16:05",
        halt: [
          {
            id: "0",
            name: "",
            time: "",
          },
        ],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "05:17",
        halt: [
          {
            id: "0",
            name: "Калуга, автовокзал",
            time: "05:17",
          },
          {
            id: "1",
            name: "Калуга, Школа №6",
            time: "",
          },
          {
            id: "2",
            name: "Калуга-Бор, санаторий",
            time: "",
          },
          {
            id: "3",
            name: "Лесная Сказка, санаторий",
            time: "",
          },
          {
            id: "4",
            name: "Сокол, санаторий",
            time: "",
          },
          {
            id: "5",
            name: "Анненки / Областная больница, поворот",
            time: "",
          },
          {
            id: "6",
            name: "Анненки, Пост ДПС",
            time: "",
          },
          {
            id: "7",
            name: "Орленок, лагерь отдыха",
            time: "",
          },
          {
            id: "8",
            name: "Калуга-2, поворот",
            time: "",
          },
          {
            id: "9",
            name: "Мстихино",
            time: "",
          },
          {
            id: "10",
            name: "Мстихинский карьер",
            time: "",
          },
          {
            id: "11",
            name: "Спутник, детский оздоровительный лагерь",
            time: "",
          },
          {
            id: "12",
            name: "Село имени Льва Толстого",
            time: "",
          },
          {
            id: "13",
            name: "Комплекс МТФ",
            time: "",
          },
          {
            id: "14",
            name: "Каравай",
            time: "",
          },
          {
            id: "15",
            name: "Дачи Товарковские",
            time: "",
          },
          {
            id: "16",
            name: "Акатово",
            time: "",
          },
          {
            id: "17",
            name: "ЛТП",
            time: "",
          },
          {
            id: "18",
            name: "Улица Дзержинского",
            time: "",
          },
          {
            id: "19",
            name: "Шаня, поворот",
            time: "",
          },
          {
            id: "20",
            name: "Шаня",
            time: "",
          },
          {
            id: "21",
            name: "Товарково",
            time: "06:22",
          },
        ],
      },
    ],
  },
];

// {
//   id: 0,
//       name: "05:17",
//     halt: [
//   {
//     id: "0",
//     name: "Калуга, автовокзал",
//     time: "05:17",
//   },
//   {
//     id: "1",
//     name: "Калуга, Школа №6",
//     time: "",
//   },
//   {
//     id: "2",
//     name: "Калуга-Бор, санаторий",
//     time: "",
//   },
//   {
//     id: "3",
//     name: "Лесная Сказка, санаторий",
//     time: "",
//   },
//   {
//     id: "4",
//     name: "Сокол, санаторий",
//     time: "",
//   },
//   {
//     id: "5",
//     name: "Анненки / Областная больница, поворот",
//     time: "",
//   },
//   {
//     id: "6",
//     name: "Анненки, Пост ДПС",
//     time: "",
//   },
//   {
//     id: "7",
//     name: "Орленок, лагерь отдыха",
//     time: "",
//   },
//   {
//     id: "8",
//     name: "Калуга-2, поворот",
//     time: "",
//   },
//   {
//     id: "9",
//     name: "Мстихино",
//     time: "",
//   },
//   {
//     id: "10",
//     name: "Мстихинский карьер",
//     time: "",
//   },
//   {
//     id: "11",
//     name: "Спутник, детский оздоровительный лагерь",
//     time: "",
//   },
//   {
//     id: "12",
//     name: "Село имени Льва Толстого",
//     time: "",
//   },
//   {
//     id: "13",
//     name: "Комплекс МТФ",
//     time: "",
//   },
//   {
//     id: "14",
//     name: "Каравай",
//     time: "",
//   },
//   {
//     id: "15",
//     name: "Дачи Товарковские",
//     time: "",
//   },
//   {
//     id: "16",
//     name: "Акатово",
//     time: "",
//   },
//   {
//     id: "17",
//     name: "ЛТП",
//     time: "",
//   },
//   {
//     id: "18",
//     name: "Улица Дзержинского",
//     time: "",
//   },
//   {
//     id: "19",
//     name: "Шаня, поворот",
//     time: "",
//   },
//   {
//     id: "20",
//     name: "Шаня",
//     time: "",
//   },
//   {
//     id: "21",
//     name: "Товарково",
//     time: "06:22",
//   },
// ],
// }, TODO: рейсы автобусов и траликов
