export const countryTransport = [
  {
    id: "0",
    name: "29",
    stopsAb:
      "Калуга 1 - ул. Ленина - ул. Кирова - пл. Мира - ул. Гагарина - Калуга - Правобережный пр-д - ул. Генерала Попова - ул. Фомушина - ул. 65 лет Победы - ул. Георгия Амелина - ул. Братьев Луканиных - Конечная Кошелев-Проект",
    stopsbA:
      "Кошелев-проект - ул. Братьев Луканиных - ул. Георгия Амелина - ул. 65 лет Победы - Калуга - ул. Генерала Попова - Правобережный пр-д - Калуга - ул. Гагарина - ул. Кирова - ул. Ленина - 3 - Конечная Калуга-1",
    routesTO: [
      {
        id: 0,
        name: "06:35",
        halt: [],
      },
      {
        id: 1,
        name: "07:20",
        halt: [],
      },
      {
        id: 2,
        name: "08:10",
        halt: [],
      },
      {
        id: 3,
        name: "09:10",
        halt: [],
      },
      {
        id: 4,
        name: "10:10",
        halt: [],
      },
      {
        id: 5,
        name: "11:10",
        halt: [],
      },
      {
        id: 6,
        name: "12:10",
        halt: [],
      },
      {
        id: 7,
        name: "14:10",
        halt: [],
      },
      {
        id: 8,
        name: "15:10",
        halt: [],
      },
      {
        id: 9,
        name: "16:10",
        halt: [],
      },
      {
        id: 10,
        name: "17:10",
        halt: [],
      },
      {
        id: 11,
        name: "18:10",
        halt: [],
      },
      {
        id: 12,
        name: "19:10",
        halt: [],
      },
      {
        id: 13,
        name: "20:10",
        halt: [],
      },
      {
        id: 14,
        name: "21:20",
        halt: [],
      },
      {
        id: 15,
        name: "22:00",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:10 (по будням)",
        halt: [],
      },
      {
        id: 1,
        name: "06:35",
        halt: [],
      },
      {
        id: 2,
        name: "07:30",
        halt: [],
      },
      {
        id: 3,
        name: "08:10",
        halt: [],
      },
      {
        id: 4,
        name: "09:10",
        halt: [],
      },
      {
        id: 5,
        name: "10:10",
        halt: [],
      },
      {
        id: 6,
        name: "11:10",
        halt: [],
      },
      {
        id: 7,
        name: "12:10",
        halt: [],
      },
      {
        id: 8,
        name: "14:10",
        halt: [],
      },
      {
        id: 9,
        name: "15:10",
        halt: [],
      },
      {
        id: 10,
        name: "16:10",
        halt: [],
      },
      {
        id: 11,
        name: "17:10",
        halt: [],
      },
      {
        id: 12,
        name: "18:10",
        halt: [],
      },
      {
        id: 13,
        name: "19:10",
        halt: [],
      },
      {
        id: 14,
        name: "20:10",
        halt: [],
      },
      {
        id: 15,
        name: "21:20",
        halt: [],
      },
      {
        id: 16,
        name: "22:00",
        halt: [],
      },
    ],
  },
  {
    id: "0",
    name: "33",
    stopsAb:
      "Рынок (ул. Герцена) - Калуга - ул. Кирова - пл. Мира - ул. Гагарина - Калуга - ул. Лесная - Лесная",
    stopsbA:
      "Лесная - ул. Лесная - Калуга - ул. Гагарина - ул. Плеханова - Калуга - Рынок (ул. Герцена)",
    routesTO: [
      {
        id: 0,
        name: "06:00",
        halt: [],
      },
      {
        id: 1,
        name: "07:00",
        halt: [],
      },
      {
        id: 2,
        name: "08:00",
        halt: [],
      },
      {
        id: 3,
        name: "09:00",
        halt: [],
      },
      {
        id: 4,
        name: "11:00",
        halt: [],
      },
      {
        id: 5,
        name: "12:00",
        halt: [],
      },
      {
        id: 6,
        name: "13:00",
        halt: [],
      },
      {
        id: 7,
        name: "15:30",
        halt: [],
      },
      {
        id: 8,
        name: "16:30",
        halt: [],
      },
      {
        id: 9,
        name: "17:30",
        halt: [],
      },
      {
        id: 10,
        name: "18:30",
        halt: [],
      },
      {
        id: 11,
        name: "20:30",
        halt: [],
      },
    ],
    routesOut: [
      {
        id: 0,
        name: "06:30",
        halt: [],
      },
      {
        id: 1,
        name: "07:30",
        halt: [],
      },
      {
        id: 2,
        name: "08:30",
        halt: [],
      },
      {
        id: 3,
        name: "09:30",
        halt: [],
      },
      {
        id: 4,
        name: "11:30",
        halt: [],
      },
      {
        id: 5,
        name: "12:30",
        halt: [],
      },
      {
        id: 6,
        name: "13:30",
        halt: [],
      },
      {
        id: 7,
        name: "16:00",
        halt: [],
      },
      {
        id: 8,
        name: "17:00",
        halt: [],
      },
      {
        id: 9,
        name: "18:00",
        halt: [],
      },
      {
        id: 10,
        name: "19:00",
        halt: [],
      },
      {
        id: 11,
        name: "21:00",
        halt: [],
      },
    ],
  },
];

export const transport = [
  {
    id: "0",
    name: "Пригородный транспорт",
    enName: "BetweenCountry",
    variants: [
      {
        id: "0",
        name: "Калуга-Товарково",
        routes: [
          {
            id: 0,
            name: "5:17",
            halt: [
              {
                id: "0",
                name: "Калуга,автовокзал",
                time: "5-17",
              },
              {
                id: "1",
                name: "Калуга, 6 школа",
                time: "5-28",
              },
              {
                id: "2",
                name: '"Калуга-Бор", санаторий',
                time: "5-30",
              },
            ],
          },
          {
            id: 1,
            name: "5:20",
            halt: [
              {
                id: "0",
                name: "Калуга,автовокзал",
                time: "5-30",
              },
              {
                id: "1",
                name: "Калуга, 6 школа",
                time: "5-33",
              },
              {
                id: "2",
                name: '"Лесная Сказка", санаторий',
                time: "5-35",
              },
              {
                id: "2",
                name: '"Сокол", санаторий',
                time: "5-36",
              },
            ],
          },
        ],
      },
    ],
  },
];
